Repository: ZeZoSaYeD/Thriving-Together
Catalog: lib/l10n/app_*.arb
Languages: ar

# homePageTitle
source: Home
ar: الصفحة الرئيسية

# articlesPageTitle
source: Articles
ar: المقالات

# diagnosesPageTitle
source: Diagnoses and Treatments
ar: التشخيصات والعلاجات

# settingsPageTitle
source: Settings
ar: الإعدادات

# examsPageWelcome
source: Welcome To Exams Page
ar: مرحبا بك في صفحة الاختبارات

# loginPageTitle
source: Login
ar: تسجيل الدخول

# signupPageTitle
source: Sign Up
ar: إنشاء حساب

source: Language
ar: اللغة

source: Dark Mode
ar: الوضع الليلي

source: Logout
ar: تسجيل الخروج

# welcomeMessage
source: Welcome {username} to Thriving Together! Be your child's personal tutor Designed for those with children who have communication disorders Helps you communicate with your child and provides exercises to improve their life
ar: مرحبًا {username} في الازدهار معا! كن المعلم الشخصي لطفلك مصمم خصيصًا لأولئك الذين لديهم أطفال يعانون من اضطرابات التواصل يساعدك على التواصل مع طفلك ويقدم تمارين لمساعدتهم على تحسين حياتهم

# welcomeSubtitle
source: Start your journey to better communication today!
ar: ابدأ رحلتك نحو تواصل أفضل اليوم!

# personalTutor
source: Be your child's personal tutor
ar: كن المعلم الشخصي لطفلك

# designedFor
source: Designed for those with children who have communication disorders
ar: مصمم خصيصًا لأولئك الذين لديهم أطفال يعانون من اضطرابات التواصل

# helpImprove
source: Helps you communicate with your child and provides exercises to improve their life
ar: يساعدك على التواصل مع طفلك ويقدم تمارين لمساعدتهم على تحسين حياتهم

source: Read More
ar: المزيد

source: Speech Disorders
ar: اضطرابات النطق والكلام

source: Language Disorders
ar: اضطرابات اللغه

# autismSpectrum
source: Autism Spectrum Disorder
ar: اضطراب طيف التوحد

source: Voice Disorders
ar: اضطرابات الصوت

source: Exams
ar: الاختبارات

# team
source: Meet The Team
ar: فريق العمل

source: help
ar: مساعدة

# splashWelcome
source: Welcome To Thriving Together
ar: مرحبا في الازدهار معا

# splashMoto
source: Designed specifically to help you in your journey with your child
ar: صنع خصيصا لنساعدك في رحلتك مع طفلك

# splashButton
source: Continue
ar: استمرار

source: Login
ar: تسجيل الدخول

# userTextfield
source: Username
ar: اسم المستخدم

# passwordTextfield
source: Password
ar: كلمه المرور

# emptyField
source: The Field Is Empty
ar: الحقل فارغ

# passwordChar
source: Password Must Not Be More Than 10 Charcters
ar: كلمه المرور لا يمكن ان تكون اكثر من 10 رموز

source: Remember Me
ar: تذكرني

# forgotPassword
source: Forgot Your Password ?
ar: هل نسيت كلمه المرور ؟

# resetEmailSent
source: Password reset email sent! Check your inbox.
ar: تم إرسال رابط إعادة تعيين كلمة المرور! تحقق من بريدك.

# emailRequired
source: Please enter your email
ar: الرجاء إدخال البريد الإلكتروني

source: Send Reset Link
ar: إرسال رابط التعيين

# accountSuccess
source: Account created successfully!
ar: تم إنشاء الحساب بنجاح!

# userExists
source: User already exists
ar: المستخدم موجود بالفعل

# wrongUserOrPass
source: Wrong username or password
ar: اسم المستخدم أو كلمة المرور غير صحيحة

# resetFailed
source: Password reset failed. Please try again.
ar: فشل إعادة تعيين كلمة المرور. يرجى المحاولة مرة أخرى.

# account
source: Don't Have An Account ??
ar: ليس لديك حساب ؟

# newAccount
source: Sign Up...
ar: إنشاء حساب....

# emptyUser
source: Username Can't Be Empty..
ar: .اسم المستخدم لا يمكن أن يكون فارغًا

# userChar
source: Username Can't Be More Than 10 Characters
ar: .اسم المستخدم لا يمكن أن يتجاوز 10 أحرف

source: Email
ar: البريد الإلكتروني

# emptyPass
source: Password Can't Be Empty..
ar: .كلمه المرور لا يمكن أن يكون فارغًا

# emptyPhone
source: Phone Number Can't Be Empty..
ar: .رقم الهاتف الجوال لا يمكن أن يكون فارغًا

# phoneMust
source: Phone Number Must Contain Numbers Only
ar: .رقم الهاتف يجب أن يحتوي على أرقام فقط

source: Phone Number
ar: رقم الهاتف

source: Sign Up
ar: تسجيل

# haveAccount
source: Do You Have An Account ??
ar: هل لديك حساب ؟؟

# validEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صحيح

# accountSucess
source: Account Created Successfully
ar: تم إنشاء الحساب بنجاح

source: Choose Language
ar: اختر اللغة

source: Loading...
ar: .....جاري التحميل

# autismSpectrumDisorderTitle
source: Autism Spectrum Disorder Diagnosis
ar: تشخيص اضطراب طيف التوحد

# autismDefinition
source: Autism or Autism Spectrum Disorder is one of a group of developmental disorders known in our society as Autism Spectrum Disorders. It typically appears during infancy, usually before the age of three. While the severity and symptoms of autism vary significantly from case to case, all autism spectrum disorders affect a child's ability to communicate, interact with others, and form mutual relationships.
ar: التوحد او اضطراب طيف التوحد,هو أحد مجموعة من اضطرابات النمو التي تعرف في مجتمعنا باسم اضطرابات طيف التوحد. يظهر عادة خلال مراحل الرضاعة, غالباّ قبل سن الثالثة. بينما تختلف شدة و أعراض التوحد بشكل كبير من حالة اٍلي اٍخري, تؤثر جميع اضطرابات طيف التوحد علي قدرة الطفل علي التواصل , التفاعل مع الأخرين , و تكوين علاقات متبادلة

# prevalenceAndDiagnosisTitle
source: Prevalence and Diagnosis
ar: الانتشار والتشخيص

# prevalenceText
source: Estimates indicate that 6 out of every 1,000 children in the United States are diagnosed with autism, with a steady increase in diagnosed cases. It remains unclear whether this rise is due to improved diagnostic methods and awareness, an actual increase in prevalence, or a combination of factors. Although there is currently no cure for autism, intensive treatments and early diagnosis can significantly improve the quality of life for children with this disorder.
ar: تشير التقديرات إلى أن 6 من كل 1000 طفل في الولايات المتحدة يتم تشخيصهم بالتوحد، مع زيادة مطردة في الحالات المشخصة. لا يزال من غير الواضح ما إذا كان هذا الارتفاع يرجع إلى تحسين أساليب التشخيص والوعي، أو زيادة حقيقية في الانتشار، أو مزيج من العوامل. على الرغم من عدم وجود علاج للتوحد حالياً، فإن العلاجات المكثفة والتشخيص المبكر يمكن أن يحسن بشكل كبير نوعية الحياة للأطفال المصابين بهذا الاضطراب.

# coreDevelopmentalChallengesTitle
source: Core Developmental Challenges
ar: التحديات النمائية الأساسية

# coreChallengesIntro
source: Children with autism often show challenges in three main developmental areas:
ar: غالبًا ما يُظهر الأطفال المصابون بالتوحد تحديات في ثلاث مجالات نمائية رئيسية:

# socialInteraction
source: 1. Social Interaction:
ar: 1. التفاعل الاجتماعي:

# socialInteractionText
source: Difficulty in establishing reciprocal social relationships.
ar: صعوبة في إقامة علاقات اجتماعية متبادلة.

# languageasd
source: 2. Language:
ar: 2. اللغة:

# languageText
source: Delayed or impaired communication abilities.
ar: تأخر أو ضعف في قدرات التواصل.

# behavior
source: 3. Behavior:
ar: 3. السلوك:

# behaviorText
source: Repetitive behaviors and limited interests.
ar: سلوكيات متكررة واهتمامات محدودة.

# developmentalProgression
source: As children with autism grow older, some may develop better social skills and show fewer behavioral difficulties, even living relatively normal lives. However, others may continue to face challenges in language skills and social interaction, and behavioral difficulties may worsen over time. Some children with autism learn slowly, while others have average or above-average intelligence. These children may learn quickly but struggle to apply their knowledge in daily life or adapt to different situations. A small group of individuals with autism show exceptional skills in specific areas such as art, mathematics, or musicâ€”they are called 'autistic savants'.
ar: مع تقدم الأطفال المصابين بالتوحد في العمر، قد يطور بعضهم مهارات اجتماعية أفضل ويظهرون صعوبات سلوكية أقل، حتى أن بعضهم قد يعيش حياة طبيعية نسبياً. ومع ذلك، قد يستمر آخرون في مواجهة تحديات في مهارات اللغة والتفاعل الاجتماعي، وقد تتفاقم الصعوبات السلوكية مع مرور الوقت. بعض الأطفال المصابين بالتوحد يتعلمون ببطء، بينما يتمتع آخرون بذكاء متوسط أو فوق المتوسط. هؤلاء الأطفال قد يتعلمون بسرعة ولكنهم يكافحون لتطبيق معرفتهم في الحياة اليومية أو التكيف مع المواقف المختلفة. تظهر مجموعة صغيرة من الأفراد المصابين بالتوحد مهارات استثنائية في مجالات محددة مثل الفن أو الرياضيات أو الموسيقى - ويُطلق عليهم اسم 'العباقرة التوحديين'.

# autismSymptomsTitle
source: Symptoms of Autism
ar: أعراض التوحد

# symptomsIntro
source: The signs and symptoms of autism vary widely, with each individual displaying unique behaviors and skills. However, severe cases are often characterized by an inability to communicate and form social relationships.
ar: تختلف علامات وأعراض التوحد على نطاق واسع، حيث يظهر كل فرد سلوكيات ومهارات فريدة. ومع ذلك، تتميز الحالات الشديدة بعدم القدرة على التواصل وتكوين العلاقات الاجتماعية.

# commonSymptomsTitle
source: Common Symptoms:
ar: الأعراض الشائعة:

# socialDeficits
source: 1. Social Interaction Deficits:
ar: 1. عجز في التفاعل الاجتماعي:

# socialDeficitsList
source: * Delayed speech development. * Avoids direct eye contact. * Appears not to hear when spoken to. * Resists physical affection or withdraws. * Lacks awareness of others' emotions. * Prefers solitary play, retreating into a personal world.
ar: * تأخر في تطور الكلام. * يتجنب الاتصال البصري المباشر. * يبدو وكأنه لا يسمع عند التحدث إليه. * يقاوم المودة الجسدية أو ينسحب. * يفتقر إلى إدراك مشاعر الآخرين. * يفضل اللعب المنعزل، وينسحب إلى عالمه الخاص.

# languageChallenges
source: 2. Language Challenges:
ar: 2. تحديات اللغة:

# languageChallengesList
source: * Delayed speech development. * Loss of previously acquired words or phrases. * Uses eye contact only to express needs. * Speaks with unusual intonation, rhythm, or robotic tone. * Has difficulty initiating or maintaining conversations. * Repeats words or phrases without understanding their usage.
ar: * تأخر في تطور الكلام. * فقدان الكلمات أو العبارات التي تم تعلمها سابقاً. * يستخدم الاتصال البصري فقط للتعبير عن الاحتياجات. * يتكلم بنبرة وإيقاع غير عاديين أو بصوت روبوتي. * يواجه صعوبة في بدء المحادثات أو الحفاظ عليها. * يكرر كلمات أو عبارات دون فهم استخدامها.

# behavioralPatterns
source: 3. Behavioral Patterns:
ar: 3. أنماط سلوكية:

# behavioralPatternsList
source: * Engages in repetitive motions such as rocking, spinning, or hand flapping. * Develops specific routines and rituals, resisting any changes. * Displays hyperactivity or inability to remain still. * Fixates on particular object details, such as spinning wheels on a toy car. * Exhibits hypersensitivity to sensory input, such as light or sound, while being seemingly indifferent to pain.
ar: * ينخرط في حركات متكررة مثل التأرجح أو الدوران أو رفرفة اليدين. * يطور روتينات وطقوساً محددة، ويقاوم أي تغييرات. * يظهر فرط نشاط أو عدم قدرة على البقاء ساكناً. * يركز على تفاصيل معينة للأشياء، مثل عجلات الدوران في سيارة لعبة. * يظهر حساسية مفرطة للمدخلات الحسية، مثل الضوء أو الصوت، بينما يبدو غير مبالٍ بالألم.

# youngChildrenNote
source: Some young children struggle to share experiences with others or adapt to changes in their environment.
ar: بعض الأطفال الصغار يجدون صعوبة في مشاركة التجارب مع الآخرين أو التكيف مع التغييرات في بيئتهم.

# causesAndRiskFactorsTitle
source: Causes and Risk Factors of Autism
ar: أسباب وعوامل خطر التوحد

# causesIntro
source: The exact cause of autism remains unclear, though research suggests that a combination of genetic and environmental factors plays a significant role.
ar: السبب الدقيق للتوحد لا يزال غير واضح، على الرغم من أن البحث يشير إلى أن مزيجاً من العوامل الوراثية والبيئية يلعب دوراً مهماً.

source: Genetic Factors:
ar: العوامل الوراثية:

# geneticFactorsText
source: Researchers have identified several genes potentially associated with autism. Some of these genes increase susceptibility to the disorder, while others influence brain development and connectivity between neurons. Genetic mutations may be inherited or occur spontaneously.
ar: حدد الباحثون عدة جينات قد تكون مرتبطة بالتوحد. بعض هذه الجينات تزيد من القابلية للإصابة بالاضطراب، بينما يؤثر البعض الآخر على تطور الدماغ واتصال الخلايا العصبية. قد تكون الطفرات الجينية موروثة أو تحدث تلقائياً.

source: Environmental Factors:
ar: عوامل بيئية:

# environmentalFactorsText
source: Lack of linguistic interaction or neglect
ar: نقص التفاعل اللغوي أو الإهمال

source: Additional Theories:
ar: نظريات إضافية:

# additionalTheoriesText
source: Other potential contributors under investigation include complications during childbirth and the role of the immune system in autism. Some researchers also suggest that damage to the amygdala, a brain region associated with emotional regulation, may be a factor.
ar: تشمل العوامل المحتملة الأخرى قيد البحث مضاعفات أثناء الولادة ودور الجهاز المناعي في التوحد. يقترح بعض الباحثين أيضاً أن تلف اللوزة الدماغية، وهي منطقة في الدماغ مرتبطة بتنظيم العواطف، قد يكون عاملاً مساهماً.

# knownRiskFactorsTitle
source: Known Risk Factors:
ar: عوامل الخطر المعروفة:

# gender
source: 1. Gender:
ar: 1. الجنس:

# genderText
source: Boys are three times more likely to develop autism than girls.
ar: الذكور أكثر عرضة للإصابة بالتوحد بثلاث مرات من الإناث.

# familyHistory
source: 2. Family History:
ar: 2. التاريخ العائلي:

# familyHistoryText
source: Families with one child diagnosed with autism have a higher likelihood of having another affected child.
ar: العائلات التي لديها طفل واحد مصاب بالتوحد لديها احتمال أكبر لإنجاب طفل آخر مصاب.

# medicalConditions
source: 3. Medical Conditions:
ar: 3. الحالات الطبية:

# medicalConditionsText
source: Certain medical disorders, including Fragile X Syndrome, Tuberous Sclerosis, Tourette Syndrome, and epilepsy, increase the risk of autism.
ar: بعض الاضطرابات الطبية، بما في ذلك متلازمة إكس الهش، والتصلب الحدبي، ومتلازمة توريت، والصرع، تزيد من خطر الإصابة بالتوحد.

# parentalAge
source: 4. Parental Age:
ar: 4. عمر الوالدين:

# parentalAgeText
source: Advanced paternal age is associated with a higher likelihood of autism.
ar: ارتفاع عمر الأب مرتبط بزيادة احتمالية الإصابة بالتوحد.

# complicationsTitle
source: Complications:
ar: المضاعفات:

# complicationsIntro
source: Autism can lead to challenges in several areas of life, including:
ar: يمكن أن يؤدي التوحد إلى تحديات في عدة مجالات من الحياة، بما في ذلك:

# complicationsList
source: * Academic difficulties. * Social isolation. * Inability to live independently. * Increased stress. * Risk of abuse or mistreatment.
ar: * صعوبات أكاديمية. * عزلة اجتماعية. * عدم القدرة على العيش بشكل مستقل. * زيادة التوتر. * خطر التعرض للإساءة أو سوء المعاملة.

# diagnosisTitle
source: Diagnosing Speech Disorders
ar: تشخيص اضطرابات النطق

# diagnosisIntro
source: Diagnosing autism involves:
ar: تشخيص التوحد يتضمن:

# diagnosisList
source: * A clinical evaluation of the child by a specialist. * Discussions with parents about the child's social, linguistic, and behavioral development. * A series of tests to assess communication, language, and psychological aspects. * While initial signs may appear before 18 months, a definitive diagnosis is often made between ages 2 and 3, when developmental delays in language and social interaction become more apparent. Early diagnosis is critical, as intervention before age 3 significantly improves outcomes.
ar: * تقييمًا سريريًا للطفل من قبل أخصائي. * مناقشات مع الوالدين حول تطور الطفل الاجتماعي واللغوي والسلوكي. * سلسلة من الاختبارات لتقييم التواصل واللغة والجوانب النفسية. * بينما قد تظهر العلامات الأولية قبل 18 شهراً، غالباً ما يتم التشخيص النهائي بين سن 2 و3 سنوات، عندما تصبح التأخرات النمائية في اللغة والتفاعل الاجتماعي أكثر وضوحاً. يعتبر التشخيص المبكر حاسماً، حيث أن التدخل قبل سن الثالثة يحسن النتائج بشكل كبير.

# treatmentOptionsTitle
source: Treatment Options
ar: خيارات العلاج

# treatmentIntro
source: No single treatment is universally effective for all individuals with autism. A variety of therapies can be implemented at home or in educational settings, including:
ar: لا يوجد علاج واحد فعال عالمياً لجميع الأفراد المصابين بالتوحد. يمكن تنفيذ مجموعة متنوعة من العلاجات في المنزل أو في البيئات التعليمية، بما في ذلك:

# behavioralTherapy
source: 1. Behavioral Therapy:
ar: 1. العلاج السلوكي:

# behavioralTherapyText
source: Focused on improving specific behaviors.
ar: يركز على تحسين سلوكيات محددة.

# speechTherapy
source: 2. Speech and Language Therapy:
ar: 2. علاج النطق واللغة:

# speechTherapyText
source: Aims to enhance communication skills.
ar: يهدف إلى تعزيز مهارات التواصل.

# educationalInterventions
source: 3. Educational Interventions:
ar: 3. التدخلات التعليمية:

# educationalInterventionsText
source: Structured teaching programs tailored to the child's needs.
ar: برامج تعليمية منظمة مصممة وفقاً لاحتياجات الطفل.

# medication
source: 4. Medication:
ar: 4. الأدوية:

# medicationText
source: Used to address specific symptoms such as anxiety or hyperactivity.
ar: تُستخدم لمعالجة أعراض محددة مثل القلق أو فرط النشاط.

# alternativeTherapies
source: 5. Alternative Therapies:
ar: 5. علاجات بديلة:

# alternativeTherapiesText
source: Some families explore dietary changes or unconventional approaches, though scientific evidence supporting their efficacy is limited.
ar: قد يلجأ بعض الأسر إلى تغييرات غذائية أو أساليب غير تقليدية، على الرغم من أن الأدلة العلمية التي تدعم فعاليتها محدودة.

# alternativeExamplesTitle
source: Examples of Alternative Therapies:
ar: أمثلة على العلاجات البديلة:

# alternativeExamplesList
source: * Creative interventions. * Specialized diets.
ar: * تدخلات إبداعية. * أنظمة غذائية متخصصة.

# alternativeTherapiesNote
source: While some families report positive outcomes with alternative therapies, their effectiveness remains a topic of ongoing research and debate.
ar: بينما أفادت بعض العائلات بنتائج إيجابية مع العلاجات البديلة، فإن فعاليتها تظل موضوعاً للبحث والنقاش المستمر.

# languageDisordersTitle
source: Language Disorders
ar: اضطرابات اللغة

# languageTitle
source: Language :
ar: اللغة :

# languageDefinition
source: Language is a universal symbolic system used for communication. This system is globally agreed upon and involves assigning meanings to sounds, words, gestures, and other symbols (Al-Khatib & Al-Hadidi, 2009).
ar: اللغة هي نظام رمزي شامل يستخدم للتواصل. هذا النظام متفق عليه عالميًا ويتضمن تعيين معاني للأصوات، الكلمات، الإيماءات، والرموز الأخرى (الخطيب والحديدي، 2009).

# typesOfLanguageDisordersTitle
source: Types of Language Disorders
ar: أنواع اضطرابات اللغة

# languageDisordersClassification
source: Language disorders are classified into five main types:
ar: تصنف اضطرابات اللغة إلى خمسة أنواع رئيسية:

# phonologicalDisordersTitle
source: Phonological Disorders (Sound System):
ar: اضطرابات الصوتيات (نظام الصوت):

# phonologicalDisordersText
source: This pertains to the phonology (sound system) of language, including the rules governing the formation or combination of different sounds. The phonological level varies depending on the language used.
ar: هذا يتعلق بنظام الصوتيات في اللغة، بما في ذلك القواعد التي تحكم تكوين أو دمج الأصوات المختلفة. يختلف المستوى الصوتي اعتمادًا على اللغة المستخدمة.

# morphologicalDisordersTitle
source: Morphological Disorders (Word Structure):
ar: اضطرابات الصرف (هيكل الكلمات):

# morphologicalDisordersText
source: This refers to the set of rules governing word components that form the basic elements of meaning and word structure. Prefixes, suffixes, or other morphological changes can alter the meanings of specific words.
ar: يشير هذا إلى مجموعة القواعد التي تحكم مكونات الكلمات التي تشكل العناصر الأساسية للمعنى وهيكل الكلمة. يمكن أن تغير البادئات، اللواحق، أو التغييرات الصرفية الأخرى معاني كلمات محددة.

# syntacticDisordersTitle
source: Syntactic Disorders (Word Order and Sentence Structure):
ar: اضطرابات النحو (ترتيب الكلمات وبنية الجملة):

# syntacticDisordersText
source: This focuses on word order in sentences. As with phonological rules, syntactic structures differ between languages. For example, the way negative sentences are formed in English differs from Spanish or French.
ar: يركز هذا على ترتيب الكلمات في الجملة. كما هو الحال مع قواعد الصوتيات، تختلف الهياكل النحوية بين اللغات. على سبيل المثال، تختلف طريقة تكوين الجملة المنفية في الإنجليزية عن الإسبانية أو الفرنسية.

# semanticDisordersTitle
source: Semantic Disorders (Word and Sentence Meaning):
ar: اضطرابات الدلالة (معنى الكلمات والجمل):

# semanticDisordersText
source: These disorders involve delays in acquiring specific word meanings or relationships between words. Typically, this delay follows normal language acquisition patterns. If untreated, these challenges may persist into adolescence.
ar: تشمل هذه الاضطرابات تأخر اكتساب معاني كلمات محددة أو العلاقات بين الكلمات. عادةً ما يتوافق هذا التأخر مع الأنماط الطبيعية لاكتساب اللغة. إذا لم يتم علاجها، قد تستمر هذه التحديات حتى مرحلة المراهقة.

# pragmaticDisordersTitle
source: Pragmatic Disorders (Social Use of Language):
ar: اضطرابات البراغماتية (الاستخدام الاجتماعي للغة):

# pragmaticDisordersText
source: This aspect relates to an individual's ability to use language effectively for communication in different social contexts. Pragmatics focuses on the meaning and intent of communication within its context (Al-Zriqat, 2005).
ar: يتعلق هذا الجانب بقدرة الفرد على استخدام اللغة بشكل فعال للتواصل في سياقات اجتماعية مختلفة. تركز البراغماتية على معنى ونية التواصل ضمن سياقه (الزريقات، 2005).

# diagnosisMethodsTitle
source: Language Disorder Diagnosis Methods
ar: طرق تشخيص اضطرابات اللغة

# diagnosisMethodsText
source: Diagnosing language disorders involves collecting individual history, direct clinical observation in various contexts (e.g., home, school, or workplace), and results from standardized language assessments. These assessments help evaluate symptom severity and support diagnosis. A positive family history of language disorders often reinforces the diagnosis (Faqiri & Awad, 2016). Children or individuals with language disorders may be shy or reserved in conversations, preferring to communicate only with family members or familiar people.
ar: يتضمن تشخيص اضطرابات اللغة جمع تاريخ الفرد، الملاحظة السريرية المباشرة في سياقات مختلفة (مثل المنزل، المدرسة، أو مكان العمل)، ونتائج التقييمات اللغوية المعيارية. تساعد هذه التقييمات في تقييم شدة الأعراض ودعم التشخيص. غالبًا ما يعزز التاريخ العائلي الإيجابي لاضطرابات اللغة التشخيص (فقيري وعودة، 2016). قد يكون الأطفال أو الأفراد الذين يعانون من اضطرابات اللغة خجولين أو محجوزين في المحادثات، مفضلين التواصل فقط مع أفراد العائلة أو الأشخاص المألوفين.

# recommendationTitle
source: Recommendation
ar: التوصية

# recommendationText
source: Families with children experiencing one or more language disorders are encouraged to seek appropriate therapeutic interventions to prevent worsening problems and future treatment difficulties.
ar: يُشجع الأسر التي لديها أطفال يعانون من اضطرابات لغة واحدة أو أكثر على البحث عن التدخلات العلاجية المناسبة لمنع تفاقم المشكلات وصعوبة معالجتها في المستقبل.

# speechDisordersTitle
source: Speech Disorders
ar: اضطرابات النطق

# speechDisordersIntro
source: People without disabilities rely heavily on verbal communication methods to share their thoughts and feelings with others and acquire new information through their interactions. Speech disorders vary by gender, type, age, and environment. Some disorders, such as stuttering, increase in prevalence with age. These disorders arise from speech errors caused by improper sequential use of jaw and lip movements, as noted by Al-Khatib and Al-Hadidi (2009).
ar: يعتمد الأشخاص غير المصابين بإعاقات بشكل كبير على طرق التواصل اللفظي لمشاركة أفكارهم ومشاعرهم مع الآخرين، واكتساب معلومات جديدة من خلال تفاعلاتهم معهم. تختلف اضطرابات النطق حسب الجنس، النوع، العمر، والبيئة. يمكن ملاحظة أن بعض الاضطرابات، مثل التلعثم، تزداد نسبة حدوثها مع التقدم في العمر. تنشأ هذه الاضطرابات من أخطاء في النطق، وتحدث بسبب عدم الاستخدام المتسلسل لحركة الفك والشفتين، كما أشار إليه الخاطب والحديدي (2009).

# speechDisordersDefinition
source: Speech disorders include difficulties in producing sounds correctly, which may hinder verbal communication.
ar: تشمل اضطرابات النطق صعوبات في إنتاج الأصوات بشكل صحيح، مما قد يعيق التواصل اللفظي
