Repository: ZeZoSaYeD/Thriving-Together
Catalog: lib/l10n/app_*.arb
Languages: ar

# causesOfSpeechDisordersTitle
source: Causes of Speech Disorders
ar: أسباب اضطرابات النطق

source: Physical Problems:
ar: مشاكل جسدية:

# physicalProblemsText
source: Weakness or limited movement in the jaw and lips
ar: ضعف أو حركة محدودة في الفك والشفتين

source: Congenital Anomalies:
ar: تشوهات خلقية:

# congenitalAnomaliesText
source: Such as cleft lip
ar: مثل الشفة الأرنبية

source: Psychological Factors:
ar: عوامل نفسية:

# psychologicalFactorsText
source: Anxiety or stress
ar: القلق أو التوتر

# typesOfChildSpeechDisordersTitle
source: Types of Speech Disorders in Children
ar: أنواع اضطرابات النطق لدى الأطفال

# substitutionTitle
source: 1. Substitution:
ar: 1. الاستبدال:

# substitutionText
source: This occurs when a child replaces one sound with another. For example, a child might replace the 'R' sound with 'L,' saying 'lajl' instead of 'rajl' (man). Sound substitution is one of the most common speech disorders among children, especially up to age six.
ar: يحدث هذا عندما يستبدل الطفل صوتًا بآخر. على سبيل المثال، قد يستبدل الطفل الصوت 'R' بـ 'L'، فيقول 'لاجل' بدلاً من 'رجل'. يعتبر استبدال الأصوات أحد أكثر اضطرابات النطق شيوعًا بين الأطفال، خاصة حتى سن السادسة.

# omissionTitle
source: 2. Omission:
ar: 2. الحذف:

# omissionText
source: In this case, the child omits one or more sounds from a word. Typically, the omitted sound is the last sound of the word, which may make the word incomprehensible unless placed in a familiar sentence or context. Omission makes it difficult to understand the child's speech and identify their needs or ideas, affecting communication.
ar: في هذه الحالة، يحذف الطفل صوتًا أو أكثر من الكلمة. عادةً ما يكون الصوت المحذوف هو الصوت الأخير للكلمة، مما قد يجعل الكلمة غير مفهومة ما لم توضع في جملة أو سياق مألوف للمستمع. يجعل الحذف فهم كلام الطفل وتحديد الحاجة أو الفكرة التي يرغب في التعبير عنها أمرًا صعبًا، مما يؤثر على التواصل.

# additionTitle
source: 3. Addition:
ar: 3. الإضافة:

# additionText
source: This involves the child adding an extra sound to a word, making their speech unclear and hard to understand. If this problem persists, it may lead to long-term speech difficulties.
ar: يتضمن هذا قيام الطفل بإضافة صوت إضافي إلى الكلمة، مما يجعل كلامه غير واضح ويصعب فهمه. إذا استمرت هذه المشكلة، فقد تؤدي إلى صعوبات في النطق على المدى الطويل.

# distortionTitle
source: 4. Distortion:
ar: 4. التشويه:

# distortionText
source: Here, the child produces sounds similar to those made by people without speech disorders but incorrectly. The sound deviates from its correct articulation point, and the child uses improper airflow methods to produce the sound.
ar: هنا، ينطق الطفل الأصوات التي تشبه تلك التي يصدرها الأشخاص الذين لا يعانون من اضطرابات النطق ولكن بطريقة غير صحيحة. ينحرف الصوت عن مكان نطقه الصحيح، ويستخدم الطفل طريقة غير صحيحة لتدفق الهواء لإنتاج الصوت.

# diagnosisText
source: The diagnostic process involves several steps, beginning with assessment. The specialist starts by reviewing the child's case history.
ar: تتضمن عملية التشخيص عدة خطوات، تبدأ بالتقييم. يبدأ الاختصاصي بمراجعة تاريخ حالة الطفل

# mchatTitle
source: M-CHAT (Modified Checklist for Autism in Toddlers)
ar: M-CHAT (قائمة مراجعة معدلة للتوحد عند الأطفال الصغار)

# mchatQuestion1
source: Does your child enjoy swinging, rocking, or jumping up and down?
ar: هل يستمتع طفلك عند التأرجح أو الهز أو القفز لأعلى ولأسفل؟

# mchatQuestion2
source: Is your child interested in other children?
ar: هل يهتم طفلك بالأطفال الآخرين؟

# mchatQuestion3
source: Does your child like climbing things, such as stairs?
ar: هل يحب طفلك تسلق الأشياء مثل السلالم؟

# mchatQuestion4
source: Does your child enjoy pretend play (e.g., pretending to feed a doll)?
ar: هل يحب طفلك ألعاب التظاهر (مثال: التظاهر بإطعام دمية)؟

# mchatQuestion5
source: Does your child use their finger to point to something they want?
ar: هل يستخدم طفلك إصبعه للإشارة إلى شيء يريده؟

# mchatQuestion6
source: Does your child use their finger to point at something interesting?
ar: هل يستخدم طفلك إصبعه للإشارة إلى شيء مثير لاهتمامه؟

# mchatQuestion7
source: Can your child play with small toys correctly?
ar: هل يستطيع طفلك اللعب بالألعاب الصغيرة بشكل صحيح؟

# mchatQuestion8
source: Does your child bring objects to you to show you?
ar: هل يجلب طفلك الأشياء إليك ليريك إياها؟

# mchatQuestion9
source: Does your child respond when their name is called?
ar: هل يستجيب طفلك عند مناداته باسمه؟

# mchatQuestion10
source: When you point at something, does your child look at it?
ar: عندما تشير إلى شيء ما، هل ينظر طفلك إليه؟

# mchatQuestion11
source: Can your child walk?
ar: هل يستطيع طفلك المشي؟

# mchatQuestion12
source: Does your child make brief eye contact with you?
ar: هل ينظر طفلك في عينيك لفترة قصيرة؟

# mchatQuestion13
source: Does your child try to imitate you (e.g., copying your words or actions)?
ar: هل يحاول طفلك تقليدك (مثال: تقليد كلامك أو حركاتك)؟

# mchatQuestion14
source: If you smile at your child, do they smile back?
ar: إذا ابتسمت لطفلك، هل يبتسم لك؟

# mchatQuestion15
source: Can your child understand what people around them are saying?
ar: هل يستطيع طفلك فهم ما يقوله الناس من حوله؟

# mchatQuestion16
source: If something new happens, does your child look at your face to see your reaction?
ar: إذا حدث شيء جديد، هل ينظر طفلك إلى وجهك ليرى رد فعلك؟

# mchatQuestion17
source: Does your child enjoy playing games like peek-a-boo with you?
ar: هل يحب طفلك اللعب معك مثل الغميضة أو الاستغماية؟

# mchatQuestion18
source: Does your child seem to hear normally?
ar: هل يبدو أن طفلك يسمع بشكل طبيعي؟

# mchatQuestion19
source: Does your child understand pointing with your finger?
ar: هل يفهم طفلك الإشارة إلى شيء بإصبعك؟

# mchatQuestion20
source: Does your child wander aimlessly or seem lost in thought?
ar: هل يتجول طفلك بدون هدف واضح أو يبدو عليه الشرود؟

# mchatResultLowRisk
source: No clear signs of autism, but consult a doctor if concerned.
ar: لا توجد علامات واضحة للتوحد، ولكن استشر طبيبًا إذا كنت قلقًا.

# mchatResultMediumRisk
source: Mild signs detected; consider consulting a speech therapist.
ar: قد تكون هناك بعض العلامات البسيطة، يُنصح بمراجعة أخصائي تخاطب.

# mchatResultHighRisk
source: Strong indicators of communication disorder. Seek specialist advice.
ar: هناك مؤشرات قوية على وجود اضطراب في التواصل. يُفضل استشارة أخصائي في أسرع وقت.

# mchatScore
source: You scored {score} out of {total} points.
ar: لقد حصلت على {score} من {total} نقاط.

source: Yes
ar: نعم

source: No
ar: لا

source: Next
ar: التالي

# result
source: Your Result
ar: نتيجتك

source: Restart Test
ar: إعادة الاختبار

source: Finish Test
ar: إنهاء الاختبار

# mchatDisclaimer
source: Note: This screening tool is not a diagnosis. Please consult a healthcare professional for formal evaluation.
ar: ملاحظة: هذه الأداة هي لأغراض الفحص فقط وليست تشخيصاً. يرجى استشارة أخصائي رعاية صحية للتقييم الرسمي.

# languageComprehensionTestTitle
source: Language Comprehension Test
ar: اختبار الفهم اللغوي

# scoreText
source: You answered {score} out of 10 questions correctly!
ar: لقد أجبت بشكل صحيح على {score} من 10 أسئلة!

source: Back
ar: رجوع

# selectOption
source: Please select an option
ar: الرجاء اختيار خيار

source: Correct Answer!
ar: إجابة صحيحة!

# wrongAnswer
source: Wrong!
ar: خطأ!

source: Loading questions...
ar: جارٍ تحميل الأسئلة...

# question1
source: Where is the elephant?
ar: أين الفيل؟

# question2
source: Which picture shows a child eating?
ar: أي صورة تُظهر طفلاً يأكل؟

# question3
source: Where is the car?
ar: أين السيارة؟

# question4
source: Which picture represents flying?
ar: أي صورة تعبر عن الطيران؟

# question5
source: Where is the picture of the fish?
ar: أين صورة السمكة؟

# question6
source: Who is the doctor?
ar: من هو الطبيب؟

# question7
source: Which picture shows someone reading?
ar: ما الصورة التي تُظهر شخصًا يقرأ؟

# question8
source: Which picture represents rain?
ar: أي صورة تمثل المطر؟

# question9
source: Which picture represents night?
ar: أي صورة تعبر عن الليل؟

# question10
source: Where is the ball?
ar: أين الكرة؟

# question11
source: Which picture shows someone swimming?
ar: أي صورة تُظهر شخصًا يسبح؟

# question12
source: Where is the picture of the school?
ar: أين صورة المدرسة؟

# question13
source: Which picture shows someone sleeping?
ar: أي صورة تُظهر شخصًا ينام؟

source: Mental Age Test
ar: اختبار العمر العقلي

source: Enter your age:
ar: أدخل عمرك الزمني:

# ageValidation
source: Please enter your age
ar: يرجى إدخال عمرك

# ageRangeValidation
source: Age must be between 3 and 15
ar: العمر يجب أن يكون بين 3 و 15

source: Start Test
ar: بدء الاختبار

# timeRemaining
source: Time remaining: {seconds} seconds
ar: الوقت المتبقي: {seconds} ثانية

source: Test Results
ar: نتيجة الاختبار

# mentalAgeResult
source: Your mental age: {age} years
ar: عمرك العقلي: {age} سنة

# chronologicalAge
source: Your age: {age} years
ar: عمرك الزمني: {age} سنة

# moreMature
source: Your mind is more mature than your age!
ar: عقلك أكثر نضجًا من عمرك!

# atAgeLevel
source: Your mind is at your age level or slightly below!
ar: عقلك في مستوى عمرك أو أقل قليلاً!

source: Back to Start
ar: العودة إلى البداية

# mentalAgeDisclaimer
source: Note: This test provides an estimate only. Mental age assessments should be interpreted by qualified professionals.
ar: ملاحظة: هذا الاختبار يوفر تقديرًا فقط. يجب تفسير تقييمات العمر العقلي من قبل متخصصين مؤهلين.

# q1
source: What color do you get when you mix blue and yellow?
ar: ما هو اللون الذي تحصل عليه عند مزج الأزرق مع الأصفر؟

# q1o1
source: Green
ar: أخضر

# q1o2
source: Red
ar: أحمر

# q1o3
source: Orange
ar: برتقالي

# q2
source: How many legs does a spider have?
ar: كم عدد أرجل العنكبوت؟

# q3
source: What is the next number in the sequence: 2, 4, 6, __?
ar: ما هو الرقم التالي في التسلسل: ٢, ٤, ٦, __؟

# q4
source: Which animal sleeps standing up?
ar: ما هو الحيوان الذي ينام واقفًا؟

# q4o1
source: Horse
ar: الحصان

# q4o2
source: Dog
ar: الكلب

# q4o3
source: Lion
ar: الأسد

# q5
source: What is the opposite of the word "night"?
ar: ما هو عكس كلمة (ليل)؟

# q5o1
source: Day
ar: نهار

# q5o2
source: Sun
ar: شمس

# q5o3
source: Light
ar: ضوء

# intelligenceTestTitle
source: Children's Intelligence Test
ar: اختبار ذكاء الأطفال

# intelligenceTestDescription
source: This test will help assess your child's cognitive abilities. It consists of 10 randomly selected questions with a 30-second time limit for each question.
ar: سيساعد هذا الاختبار في تقييم القدرات المعرفية لطفلك. يتكون من 10 أسئلة مختارة عشوائياً مع حد زمني 30 ثانية لكل سؤال.

source: Time left
ar: الوقت المتبقي

source: seconds
ar: ثانية

source: Your Score
ar: درجتك

source: You got
ar: لقد حصلت على

source: out of
ar: من أصل

source: questions correct
ar: إجابة صحيحة

# q1_iq
source: What is the next number in the sequence: 2, 4, 6, __?
ar: ما هو الرقم التالي في التسلسل: ٢, ٤, ٦, __؟

# q2_iq
source: Which shape has 4 equal sides?
ar: أي شكل له ٤ جوانب متساوية؟

# o1_iq2
source: Triangle
ar: مثلث

# o2_iq2
source: Circle
ar: دائرة

# o3_iq2
source: Square
ar: مربع

# q3_iq
source: Which animal makes a meow sound?
ar: ما الحيوان الذي يصدر صوت مواء؟

# o1_iq3
source: Dog
ar: كلب

# o2_iq3
source: Cat
ar: قطة

# o3_iq3
source: Cow
ar: بقرة

# q4_iq
source: How many legs does a spider have?
ar: كم عدد الأرجل لدى العنكبوت؟

# q5_iq
source: What is the color of a clear sky?
ar: ما هو لون السماء الصافية؟

# o1_iq5
source: Red
ar: أحمر

# o2_iq5
source: Blue
ar: أزرق

# o3_iq5
source: Green
ar: أخضر

# q6_iq
source: What is the opposite of the word (short)?
ar: ما هو عكس كلمة (قصير)؟

# o1_iq6
source: Long
ar: طويل

# o2_iq6
source: Wide
ar: عريض

# o3_iq6
source: Thin
ar: رفيع

# q7_iq
source: How many fingers are on one hand?
ar: كم عدد أصابع اليد الواحدة؟

# q8_iq
source: Which of these fruits is yellow?
ar: أي من هذه الفواكه لونها أصفر؟

# o1_iq8
source: Apple
ar: تفاح

# o2_iq8
source: Banana
ar: موز

# o3_iq8
source: Grapes
ar: عنب

# q9_iq
source: What number comes after 9?
ar: ما العدد الذي يلي ٩؟

# q10_iq
source: Which of these colors is the color of grass?
ar: أي من هذه الألوان هو لون العشب؟

# o1_iq10
source: Red
ar: أحمر

# o2_iq10
source: Blue
ar: أزرق

# o3_iq10
source: Green
ar: أخضر

# q11_iq
source: How many legs does an elephant have?
ar: كم عدد أرجل الفيل؟

# q12_iq
source: What lights up at night?
ar: ما هو الشيء الذي يضيء في الليل؟

# o1_iq12
source: Sun
ar: الشمس

# o2_iq12
source: Moon
ar: القمر

# o3_iq12
source: Tree
ar: الشجرة

# q13_iq
source: Which animal can fly?
ar: ما هو الحيوان الذي يطير؟

# o1_iq13
source: Fish
ar: السمكة

# o2_iq13
source: Bird
ar: العصفور

# o3_iq13
source: Rabbit
ar: الأرنب

# q14_iq
source: How many letters are in the word (apple)?
ar: كم عدد الحروف في كلمة (تفاحة)؟

# q15_iq
source: What number comes before 20?
ar: ما هو العدد الذي يأتي قبل ٢٠؟

# q16_iq
source: Which of these shapes is a circle?
ar: أي من هذه الأشكال هو دائرة؟

# o1_iq16
source: Square
ar: مربع

# o2_iq16
source: Triangle
ar: مثلث

# o3_iq16
source: Circle
ar: دائرة

# q17_iq
source: Which animal lives in water?
ar: أي حيوان يعيش في الماء؟

# o1_iq17
source: Lion
ar: أسد

# o2_iq17
source: Crocodile
ar: تمساح

# o3_iq17
source: Horse
ar: حصان

# q18_iq
source: What is the color of a ripe banana?
ar: ما هو لون الموز الناضج؟

# o1_iq18
source: Yellow
ar: أصفر

# o2_iq18
source: Green
ar: أخضر

# o3_iq18
source: Red
ar: أحمر

# q19_iq
source: Which planet is closest to the sun?
ar: أي كوكب هو الأقرب إلى الشمس؟

# o1_iq19
source: Earth
ar: الأرض

# o2_iq19
source: Mercury
ar: عطارد

# o3_iq19
source: Mars
ar: المريخ

# motivationalQuote1
source: Every small step counts. Keep going!
ar: كل خطوة صغيرة مهمة. استمر في التقدم!

# motivationalQuote2
source: Progress is progress, no matter how small
ar: التقدم هو تقدم بغض النظر عن مدى صغره

# motivationalQuote3
source: You're capable of amazing things
ar: أنت قادر على تحقيق أشياء مذهلة

# exams_start
source: Start
ar: أبدأ

# meet_the_team_title
source: Meet The Team
ar: فريق العمل

# mariam_team
source: Mariam Kamal
ar: مريم كمال

# yostena_team
source: Yostena Botros
ar: يوستينا بطرس

# karin_team
source: Karin Maged
ar: كارن ماجد

# hazem_team
source: Hazem Osama
ar: حازم أسامة

# yassa_team
source: Yassa Maher
ar: يسي ماهر

# zeyad_team
source: Zeyad Sayed
ar: زياد سيد

# web_team
source: Web Developer
ar: مطور ويب

# flutter_team
source: Flutter Developer
ar: مطور فلتر

# ai_team
source: AI Developer
ar: مطور ذكاء اصطناعي

# back_team
source: BackEnd Developer
ar: مطور الواجهة الخلفية

# speechDisordersDesc
source: Stuttering, lisping, nasality, rapid speech
ar: اللجلجه,اللثغه ,الخنف ,السرعه الزائده في الكلام

# languageDisordersDesc
source: Speech and language delay, aphasia
ar: تأخرالكلام و اللغه , الحبسه

# autismSpectrumDesc
source: Autism
ar: التوحد

# speechDisordersDescdiagnoses
source: Learn about speech disorder diagnostics and assessments
ar: تعرف على تشخيصات اضطرابات النطق والتقييمات

# languageDisordersDescdiagnoses
source: Understanding language disorder evaluation methods
ar: فهم طرق تقييم اضطرابات اللغة

# voiceDisordersDescdiagnoses
source: Comprehensive voice disorder diagnostic approaches
ar: مناهج تشخيصية شاملة لاضطرابات الصوت

# autismSpectrumDescdiagnoses
source: Diagnostic criteria and assessment for autism spectrum
ar: معايير التشخيص والتقييم لطيف التوحد

# mchatDescription
source: A brief screening tool for toddlers aged 16-30 months. Helps identify children who may need more comprehensive evaluation.
ar: أداة فحص موجزة للأطفال الصغار بعمر 16-30 شهرًا. تساعد في تحديد الأطفال الذين قد يحتاجون إلى تقييم أكثر شمولاً.

# languageComprehensionTestDesc
source: Assess understanding of spoken language
ar: تقييم فهم اللغة المنطوقة

# mentalAgeTestDesc
source: Evaluate cognitive development level
ar: تقييم مستوى التطور المعرفي

# intelligenceTestDesc
source: Comprehensive cognitive ability assessment
ar: تقييم شامل للقدرات المعرفية

source: Select your preferred language
ar: اختر لغتك المفضلة

# languageSelectionDescription
source: Choose the language you're most comfortable with. You can change this later in settings.
ar: اختر اللغة التي تفضلها. يمكنك تغيير هذا لاحقًا في الإعدادات.

# emailNotFound
source: Email not found in our system
ar: البريد الإلكتروني غير موجود في نظامنا

# passwordResetSuccess
source: Password reset successfully!
ar: تم إعادة تعيين كلمة المرور بنجاح!

source: Password reset failed
ar: فشل إعادة تعيين كلمة المرور

source: Passwords don't match
ar: كلمات المرور غير متطابقة

source: New Password
ar: كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Verify Email
ar: التحقق من البريد الإلكتروني

source: Reset Password
ar: إعادة تعيين كلمة المرور

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# recommendedArticle
source: Recommended For You
ar: المرشح لك

# carouseltext1
source: Children are like angels on earth, representing the most beautiful part of any parent's life.While children are an integral part of society, some face communication challenges whether verbal or non-verbal.
ar: الأطفال مثل الملائكة على الأرض،يمثلون أجمل جزء في حياة أي والد. في حين أن الأطفال جزء لا يتجزأ من المجتمع، يواجه البعض تحديات في التواصل - سواء كان لفظيًا أو غير لفظي.

# carouseltext2
source: In today's world, there is growing awareness of the issues these children face, and the availability of specialists and therapy centers has increased significantly.
ar: في عالم اليوم ،هناك وعي متزايد بالقضايا التي يواجهها هؤلاء الأطفال، وقد زاد توافر المتخصصين والمراكز العلاجية بشكل كبير.

# carouseltext3
source: To support parents on this journey, we present "Thriving Together", a website designed to guide you in understanding your child and helping them improve their communication skills and social integration alongside speech therapy centers.
ar: لدعم الآباء في هذه الرحلة ،نقدم "Thriving Together"، وهو موقع ويب مصمم لإرشادك في فهم طفلك ومساعدته على تحسين قدرته على التواصل والتواصل مع المجتمع بجانب مراكز التخاطب .

source: Contact Us
ar: اتصل بنا

source: Name
ar: الاسم

source: Message
ar: الرسالة

source: Submit
ar: إرسال

# nameRequired
source: Please enter your name
ar: الرجاء إدخال الاسم

# messageRequired
source: Please enter your message
ar: الرجاء إدخال الرسالة

# formSubmitted
source: Thank you! We'll contact you soon
ar: شكراً! سنتواصل معك قريباً

# emailError
source: Could not launch email client
ar: تعذر فتح عميل البريد الإلكتروني

source: Speech Disorder Diagnosis
ar: تشخيص اضطرابات النطق

# speechSoundDisorderTitle
source: Speech Sound Disorders
ar: اضطرابات أصوات الكلام

# speechDisorderDescription
source: Speech sound disorders are difficulties producing speech sounds correctly that can affect speech clarity and communication
ar: اضطرابات أصوات الكلام هي صعوبات في إنتاج الأصوات الكلامية بشكل صحيح يمكن أن تؤثر على وضوح الكلام والتواصل

# typesOfSpeechDisorders
source: Types of Speech Sound Disorders
ar: أنواع اضطرابات النطق

# articulationDisorders
source: Articulation Disorders (difficulty producing specific sounds)
ar: اضطرابات النطق (صعوبة في نطق أصوات معينة)

# phonologicalDisorders
source: Phonological Disorders (patterns of sound errors)
ar: اضطرابات صوتية (أنماط من الأخطاء الصوتية)

# childhoodApraxia
source: Childhood Apraxia of Speech
ar: تعذر الكلام في الطفولة

# dysarthria
source: Dysarthria (weakness in speech muscles)
ar: عسر التلفظ (ضعف في عضلات الكلام)

# fluencyDisorders
source: Fluency Disorders (e.g., stuttering)
ar: اضطرابات الطلاقة (مثل التلعثم)

# evaluationComponents
source: Comprehensive Evaluation Components
ar: مكونات التقييم الشامل

# oralMotorExam
source: Oral Motor Examination
ar: فحص حركة الفم والوجه

source: Speech Sound Inventory
ar: جرد الأصوات الكلامية

source: Intelligibility Rating
ar: تقييم وضوح الكلام

source: Stimulability Testing
ar: اختبار التحفيز الصوتي

source: Connected Speech Sample
ar: عينة من الكلام المتصل

source: Hearing Screening
ar: فحص السمع

# assessmentTools
source: Standardized Assessment Tools
ar: أدوات التقييم المعيارية

# gfta3Title
source: Goldman-Fristoe Test of Articulation (GFTA-3)
ar: اختبار جولدمان-فريستو للنطق (GFTA-3)

# gfta3Description
source: Assesses articulation of consonant sounds in children ages 2-21. Provides standard scores and percentile ranks
ar: يقيّم نطق الأصوات الساكنة عند الأطفال من عمر 2-21 سنة. يوفر درجات معيارية ورتب مئوية

# klpa3Title
source: Khan-Lewis Phonological Analysis (KLPA-3)
ar: تحليل خان-لويس للعمليات الصوتية (KLPA-3)

# klpa3Description
source: Provides in-depth analysis of phonological processes for children with speech sound disorders
ar: يوفر تحليلًا متعمقًا للعمليات الصوتية للأطفال الذين يعانون من اضطرابات أصوات الكلام

# deeFeyTitle
source: Dee Fey's Speech Assessment
ar: تقييم النطق لدي في

# deeFeyDescription
source: Evaluates speech sound production in connected speech and single words for children ages 3-12
ar: يقيم إنتاج الأصوات الكلامية في الكلام المتصل والكلمات المفردة للأطفال من عمر 3-12 سنة

source: Diagnostic Indicators
ar: المؤشرات التشخيصية

# diagnosticCriteria
source: Diagnosis requires: voice quality deviating from normal for age/gender, symptoms persisting beyond 2-4 weeks, and impairment in communication or quality of life.
ar: يتطلب التشخيص: جودة صوت تختلف عن الطبيعي للعمر/الجنس، أعراض تستمر لأكثر من 2-4 أسابيع، وضعف في التواصل أو جودة الحياة.

# importantNote
source: Warning: Sudden voice changes with no clear cause should be evaluated immediately to rule out serious conditions like laryngeal cancer.
ar: تحذير: التغيرات المفاجئة في الصوت دون سبب واضح يجب تقييمها فورًا لاستبعاد حالات خطيرة مثل سرطان الحنجرة.

source: Voice Disorder Diagnosis
ar: تشخيص اضطرابات الصوت

# voiceDisorderTitle
source: Voice Disorder Diagnosis
ar: تشخيص اضطرابات الصوت

# voiceDisorderDescription
source: Voice disorders involve problems with pitch, loudness, or quality of the voice that are abnormal for the speaker's age, gender, or cultural background.
ar: اضطرابات الصوت تشمل مشاكل في طبقة الصوت أو شدته أو جودته التي تكون غير طبيعية بالنسبة لعمر المتحدث أو جنسه أو خلفيته الثقافية

source: Common Voice Disorders
ar: اضطرابات الصوت الشائعة

# vocalNodules
source: Vocal nodules (calluses on vocal folds)
ar: عقيدات الأحبال الصوتية (كالو في الأحبال الصوتية)

# vocalPolyps
source: Vocal polyps (soft, fluid-filled lesions)
ar: زوائد الأحبال الصوتية (آفات مليئة بالسوائل)

# laryngitis
source: Laryngitis (inflammation of vocal folds)
ar: التهاب الحنجرة (التهاب الأحبال الصوتية)

# spasmodicDysphonia
source: Spasmodic dysphonia (neurological disorder)
ar: خلل النطق التشنجي (اضطراب عصبي)

source: Vocal fold paralysis
ar: شلل الأحبال الصوتية

# evaluationMethods
source: Comprehensive Evaluation Methods
ar: طرق التقييم الشاملة

# caseHistory
source: Case history and symptom review
ar: تاريخ الحالة ومراجعة الأعراض

# perceptualAssessment
source: Perceptual voice assessment (GRBAS scale)
ar: تقييم صوتي إدراكي (مقياس GRBAS)

# acousticAnalysis
source: Acoustic analysis (pitch, loudness, quality)
ar: تحليل صوتي (طبقة الصوت، شدته، جودته)

# laryngealVisualization
source: Laryngeal visualization (stroboscopy)
ar: فحص الحنجرة بالمنظار (ستروبوسكوبي)

# aerodynamicMeasures
source: Aerodynamic measures (airflow, pressure)
ar: قياسات ديناميكية الهواء (تدفق الهواء، الضغط)

# vhiTitle
source: VHI (Voice Handicap Index)
ar: مقياس الإعاقة الصوتية (VHI)

# vhiDescription
source: Patient-reported measure of voice-related quality of life. Assesses functional, physical, and emotional impacts.
ar: مقياس يبلغ عنه المريض لجودة الحياة المتعلقة بالصوت. يقيم التأثيرات الوظيفية والجسدية والعاطفية.

# capevTitle
source: CAPE-V (Consensus Auditory-Perceptual Evaluation)
ar: التقييم الإدراكي السمعي المتفق عليه (CAPE-V)

# capevDescription
source: Standardized protocol for perceptual evaluation of voice quality, pitch, loudness, and other characteristics.
ar: بروتوكول معياري للتقييم الإدراكي لجودة الصوت وطبقاته وشدته وخصائص أخرى.

# videostroboscopyTitle
source: Videostroboscopy
ar: تنظير الحنجرة بالستروبوسكوب
