Repository: ZeZoSaYeD/Thriving-Together
Catalog: lib/l10n/app_*.arb
Languages: ar

# videostroboscopyDescription
source: Visual examination of vocal fold vibration using synchronized light and video. Gold standard for structural assessment.
ar: فحص مرئي لاهتزاز الأحبال الصوتية باستخدام الضوء المتزامن والفيديو. المعيار الذهبي للتقييم الهيكلي.

# languageDisorderTitle
source: Language Disorder Diagnosis
ar: تشخيص اضطرابات اللغة

source: Language Disorder Diagnosis
ar: تشخيص اضطرابات اللغة

# languageDisorderDefinition
source: Language disorders involve persistent difficulties in the acquisition and use of language across modalities due to deficits in comprehension or production.
ar: تشمل اضطرابات اللغة صعوبات مستمرة في اكتساب اللغة واستخدامها عبر الوسائط بسبب عجز في الفهم أو الإنتاج.

source: Types of Language Disorders
ar: أنواع اضطرابات اللغة

# expressiveLanguageDisorder
source: Expressive Language Disorder (difficulty expressing thoughts)
ar: اضطراب اللغة التعبيري (صعوبة في التعبير عن الأفكار)

# receptiveLanguageDisorder
source: Receptive Language Disorder (difficulty understanding language)
ar: اضطراب اللغة الاستقبالي (صعوبة في فهم اللغة)

# mixedReceptiveExpressive
source: Mixed Receptive-Expressive Disorder
ar: اضطراب مختلط استقبالي-تعبيري

# phonologicalDisorder
source: Phonological Disorder (speech sound production)
ar: اضطراب الصوتيات (إنتاج أصوات الكلام)

# stutteringDisorder
source: Stuttering (fluency disorder)
ar: التلعثم (اضطراب الطلاقة)

source: Key Assessment Areas
ar: مجالات التقييم الرئيسية

# vocabularyAssessment
source: Vocabulary and word knowledge
ar: المفردات والمعرفة بالكلمات

# sentenceStructureAssessment
source: Sentence structure and grammar
ar: هيكل الجملة والقواعد

# narrativeSkillsAssessment
source: Narrative skills
ar: مهارات السرد

# socialCommunicationAssessment
source: Social communication (pragmatics)
ar: التواصل الاجتماعي (البراغماتية)

# speechSoundAssessment
source: Speech sound production
ar: إنتاج أصوات الكلام

# listeningAssessment
source: Listening comprehension
ar: فهم الاستماع

source: Standardized Assessment Tools
ar: أدوات التقييم الموحدة

# celf5Title
source: CELF-5 (Clinical Evaluation of Language Fundamentals)
ar: CELF-5 (التقييم السريري لأساسيات اللغة)

# celf5Description
source: Assesses language skills in students ages 5-21. Evaluates core language, receptive, and expressive skills. Takes 30-45 minutes.
ar: يقيم مهارات اللغة لدى الطلاب من سن 5-21. يقيم المهارات اللغوية الأساسية والاستقبالية والتعبيرية. يستغرق 30-45 دقيقة.

# pls5Title
source: PLS-5 (Preschool Language Scales)
ar: PLS-5 (مقاييس لغة ما قبل المدرسة)

# pls5Description
source: Assesses language development in children birth to 7:11. Measures auditory comprehension and expressive communication.
ar: يقيم تطور اللغة عند الأطفال من الولادة حتى 7:11. يقيس الفهم السمعي والتواصل التعبيري.

# toldp5Title
source: TOLD-P:5 (Test of Language Development)
ar: TOLD-P:5 (اختبار تطور اللغة)

# toldp5Description
source: Measures spoken language in children ages 4:0 to 8:11. Assesses semantics, syntax, and phonology.
ar: يقيس اللغة المنطوقة عند الأطفال من سن 4:0 إلى 8:11. يقيم الدلالات والتركيب النحوي وعلم الأصوات.

# diagnosisRequirements
source: Diagnosis requires: scores significantly below age expectations, difficulties not due to another condition, symptoms present from early childhood, and significant functional limitations.
ar: يتطلب التشخيص: درجات أقل بكثير من التوقعات العمرية، صعوبات ليست بسبب حالة أخرى، أعراض موجودة منذ الطفولة المبكرة، وقصور وظيفي كبير.

# languageDisorderNote
source: Note: Language disorders are distinct from speech sound disorders. A comprehensive evaluation should assess both language and speech abilities.
ar: ملاحظة: اضطرابات اللغة تختلف عن اضطرابات أصوات الكلام. يجب أن يشمل التقييم الشامل كلاً من القدرات اللغوية والكلامية.

# asdDiagnosticCriteriaTitle
source: ASD Diagnostic Criteria
ar: معايير تشخيص اضطراب طيف التوحد

# asdDiagnosisDescription
source: Autism Spectrum Disorder is diagnosed based on specific behavioral criteria. Diagnosis typically involves comprehensive evaluation by a team of specialists.
ar: يتم تشخيص اضطراب طيف التوحد بناءً على معايير سلوكية محددة. عادةً ما يتضمن التشخيص تقييمًا شاملاً من قبل فريق من المتخصصين.

# dsm5CriteriaTitle
source: DSM-5 Diagnostic Criteria
ar: معايير التشخيص حسب الدليل التشخيصي DSM-5

# asdCriterion1
source: Persistent deficits in social communication and social interaction
ar: عجز مستمر في التواصل الاجتماعي والتفاعل الاجتماعي

# asdCriterion2
source: Restricted, repetitive patterns of behavior, interests, or activities
ar: أنماط مقيدة ومتكررة من السلوك أو الاهتمامات أو الأنشطة

# asdCriterion3
source: Symptoms must be present in early developmental period
ar: يجب أن تكون الأعراض موجودة في فترة النمو المبكر

# asdCriterion4
source: Symptoms cause clinically significant impairment
ar: تسبب الأعراض ضعفًا سريريًا كبيرًا

# asdCriterion5
source: Disturbances not better explained by intellectual disability
ar: الاضطرابات لا تفسر بشكل أفضل بالإعاقة الذهنية

# assessmentToolsTitle
source: Standardized Assessment Tools
ar: أدوات التقييم المعيارية

# ados2Title
source: ADOS-2 (Autism Diagnostic Observation Schedule)
ar: ADOS-2 (جدول مراقبة تشخيص التوحد)

# ados2Description
source: A semi-structured assessment of communication, social interaction, and play for individuals suspected of having autism. Takes 40-60 minutes to administer.
ar: تقييم شبه منظم للتواصل والتفاعل الاجتماعي واللعب للأفراد المشتبه في إصابتهم بالتوحد. يستغرق التطبيق 40-60 دقيقة.

# adiRTitle
source: ADI-R (Autism Diagnostic Interview-Revised)
ar: ADI-R (مقابلة تشخيص التوحد المنقحة)

# adiRDescription
source: A comprehensive parent interview that provides a thorough assessment of individuals suspected of having autism. Takes 1.5-2.5 hours to complete.
ar: مقابلة شاملة مع الوالدين توفر تقييمًا شاملًا للأفراد المشتبه في إصابتهم بالتوحد. يستغرق إكمالها 1.5-2.5 ساعة.

# earlySignsTitle
source: Early Warning Signs
ar: علامات الإنذار المبكر

# earlySign1
source: No babbling or pointing by age 1
ar: عدم المناغاة أو الإشارة بعمر سنة

# earlySign2
source: No single words by 16 months or two-word phrases by age 2
ar: عدم نطق كلمات مفردة بعمر 16 شهرًا أو عبارات من كلمتين بعمر سنتين

# earlySign3
source: Poor eye contact
ar: ضعف التواصل البصري

# earlySign4
source: Excessive lining up of toys or objects
ar: ترتيب مفرط للألعاب أو الأشياء

# earlySign5
source: No smiling or social responsiveness
ar: عدم الابتسام أو الاستجابة الاجتماعية

# screeningProcessTitle
source: Developmental Screening Process
ar: عملية الفحص النمائي

# screeningProcessDescription
source: Diagnosis typically involves: developmental screening, comprehensive diagnostic evaluation, hearing and vision screening, genetic testing (in some cases), and neurological examination.
ar: يتضمن التشخيص عادةً: فحصًا نمائيًا، وتقييمًا تشخيصيًا شاملاً، وفحص السمع والبصر، واختبارات جينية (في بعض الحالات)، وفحصًا عصبيًا.

# asdDiagnosisNote
source: Important: Only qualified healthcare professionals should diagnose ASD. Early diagnosis and intervention can significantly improve outcomes.
ar: هام: يجب أن يتم تشخيص اضطراب طيف التوحد فقط من قبل متخصصين مؤهلين في الرعاية الصحية. يمكن أن يحسن التشخيص والتدخل المبكر النتائج بشكل كبير.

# filterSpeech
source: Speech
ar: النطق والكلام

# filterLanguage
source: Language
ar: اللغة

# filterVoice
source: Voice
ar: الصوت

# filterAutism
source: Autism
ar: التوحد

# filterCognition
source: Cognition Activities
ar: أنشطة للإدراك

# voiceDisordersDesc
source: Hoarseness, vocal fatigue, hysterical mutism
ar: البحه , الوهن الصوتي , حبسه كلاميه , الخرص الهستيري

# scrollToExercises
source: Go to Therapeutic Exercises
ar: الذهاب الي التمارين العلاجية

# selectDiagnosisType
source: Select diagnosis type to view exercises
ar: اختر نوع التشخيص لعرض التمارين العلاجية

# diagnosisHelp
source: You can use the tests page to help diagnose the condition
ar: يمكنك الاستعانه بصفحه الاختبارات للمساعده في تشخيص الحاله

# effectiveExercises
source: Some effective exercises for {filter}
ar: بعض التمارين الفعاله لعلاج {filter}

# note
source: Note: These exercises are done daily, starting with 5 repetitions per exercise per day, gradually increasing to 20 repetitions as the condition improves
ar: ملحوظه : هذه التمارين مستمره يوميا تبدأ بالتدريج من خمس عدات لكل تدريب في اليوم الي 20 عده بالتدريج مع تطور الحاله

source: Mouth and Jaw Exercises
ar: تمارين للفم والفكين

source: Tongue Exercises
ar: تمارين اللسان

source: Breathing Exercises
ar: تمارين تنفس

# abdominalBreathing
source: Abdominal Breathing Exercises
ar: تمارين تنفس بطني

# receptiveLanguage
source: Receptive Language Exercises
ar: التدريبات الخاصه باللغه الأستقبالية

# expressiveLanguage
source: Expressive Language Exercises
ar: التدريبات الخاصه باللغه التعبيريه

# voiceWarmup
source: Voice Warm-up Exercises
ar: تمارين الإحماء الصوتي

source: Other Voice Exercises
ar: تمارين أخرى للصوت

source: Non-verbal Autism
ar: التوحد غير الناطق

source: Verbal Autism
ar: التوحد الناطق

# supplementaryAutism
source: Supplementary Autism Exercises
ar: تمارين تكميلية لتطوير مهارات التوحد

source: Cognition Activities
ar: تمارين الإدراك

# testPageTitle
source: Voice Test
ar: اختبار الصوت

# testInstructions
source: Press the microphone to record your voice
ar: اضغط على الميكروفون لتسجيل صوتك

# speechInput
source: Voice Input
ar: إدخال صوتي

source: Recognized Text
ar: النص المعترف به

# speechNotAvailable
source: Speech recognition not available
ar: التعرف على الصوت غير متاح

source: Congratulations!
ar: تهانينا!

# completedExercises
source: You have successfully completed all exercises!
ar: لقد أكملت جميع التمارين بنجاح!

# score
source: Your score
ar: درجتك

source: Restart
ar: إعادة

source: Play Audio
ar: تشغيل الصوت

# enterAnswer
source: Enter your answer
ar: أدخل إجابتك

source: Check
ar: تحقق

source: Cognition Exercises
ar: تمارين الإدراك

# cognitionActivitiesDesc
source: exercises for knowledge testing
ar: تمارين لتحسين المهارات المعرفية والإدراكية

source: done
ar: تم
